## Plan Result (sbox-backendappgateway)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw"
    }

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw"
        name                              = "cft-aks00-sandbox-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (7 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/idam-hmcts-access" -> null
          - ip_addresses = [
              - "10.2.11.250",
              - "10.2.9.250",
            ] -> null
          - name         = "idam-hmcts-access" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/idam-user-dashboard" -> null
          - ip_addresses = [
              - "10.2.11.250",
              - "10.2.9.250",
            ] -> null
          - name         = "idam-user-dashboard" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/idam-web-admin" -> null
          - ip_addresses = [
              - "10.2.11.250",
              - "10.2.9.250",
            ] -> null
          - name         = "idam-web-admin" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/plum-frontend" -> null
          - ip_addresses = [
              - "10.2.11.250",
              - "10.2.9.250",
            ] -> null
          - name         = "plum-frontend" -> null
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "alertmanager-0"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "alertmanager-1"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "prometheus-0"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.2.11.250",
              + "10.2.9.250",
            ]
          + name         = "prometheus-1"
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/bulk-scan-orchestrator" -> null
          - name                                = "bulk-scan-orchestrator" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/bulk-scan-orchestrator" -> null
          - probe_name                          = "bulk-scan-orchestrator" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/bulk-scan-payment-processor" -> null
          - name                                = "bulk-scan-payment-processor" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/bulk-scan-payment-processor" -> null
          - probe_name                          = "bulk-scan-payment-processor" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/bulk-scan-processor" -> null
          - name                                = "bulk-scan-processor" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/bulk-scan-processor" -> null
          - probe_name                          = "bulk-scan-processor" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/bulk-scan-sample-app" -> null
          - name                                = "bulk-scan-sample-app" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/bulk-scan-sample-app" -> null
          - probe_name                          = "bulk-scan-sample-app" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/div-emca" -> null
          - name                                = "div-emca" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/div-emca" -> null
          - probe_name                          = "div-emca" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/draft-store-service" -> null
          - name                                = "draft-store-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/draft-store-service" -> null
          - probe_name                          = "draft-store-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/fpl-case-service" -> null
          - name                                = "fpl-case-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/fpl-case-service" -> null
          - probe_name                          = "fpl-case-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/ia-bail-case-api" -> null
          - name                                = "ia-bail-case-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/ia-bail-case-api" -> null
          - probe_name                          = "ia-bail-case-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/ia-case-api" -> null
          - name                                = "ia-case-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/ia-case-api" -> null
          - probe_name                          = "ia-case-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/ia-case-documents-api" -> null
          - name                                = "ia-case-documents-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/ia-case-documents-api" -> null
          - probe_name                          = "ia-case-documents-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/ia-case-notifications-api" -> null
          - name                                = "ia-case-notifications-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/ia-case-notifications-api" -> null
          - probe_name                          = "ia-case-notifications-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/idam-api" -> null
          - name                                = "idam-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/idam-api" -> null
          - probe_name                          = "idam-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/idam-api-sprod" -> null
          - name                                = "idam-api-sprod" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/idam-api-sprod" -> null
          - probe_name                          = "idam-api-sprod" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/idam-hmcts-access" -> null
          - name                                = "idam-hmcts-access" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/idam-hmcts-access" -> null
          - probe_name                          = "idam-hmcts-access" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/idam-testing-s

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ulk-scan-sample-app"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "bulk-scan-sample-app"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "bulk-scan-sample-app"
          + id                         = (known after apply)
          + name                       = "bulk-scan-sample-app"
          + priority                   = 360
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "dg-docmosis"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "dg-docmosis"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "dg-docmosis"
          + id                         = (known after apply)
          + name                       = "dg-docmosis"
          + priority                   = 410
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idam-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "idam-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "idam-api"
          + id                         = (known after apply)
          + name                       = "idam-api"
          + priority                   = 300
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idam-api-sprod"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "idam-api-sprod"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "idam-api-sprod"
          + id                         = (known after apply)
          + name                       = "idam-api-sprod"
          + priority                   = 310
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idam-testing-support-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "idam-testing-support-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "idam-testing-support-api"
          + id                         = (known after apply)
          + name                       = "idam-testing-support-api"
          + priority                   = 330
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idam-web-admin-sprod"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "idam-web-admin-sprod"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "idam-web-admin-sprod"
          + id                         = (known after apply)
          + name                       = "idam-web-admin-sprod"
          + priority                   = 320
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "labs-StuartBJustice"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "labs-StuartBJustice"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "labs-StuartBJustice"
          + id                         = (known after apply)
          + name                       = "labs-StuartBJustice"
          + priority                   = 280
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "labs-endakelly"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "labs-endakelly"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "labs-endakelly"
          + id                         = (known after apply)
          + name                       = "labs-endakelly"
          + priority                   = 220
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "labs-hw469"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "labs-hw469"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "labs-hw469"
          + id                         = (known after apply)
          + name                       = "labs-hw469"
          + priority                   = 270
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "labs-jefex7"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "labs-jefex7"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "labs-jefex7"
          + id                         = (known after apply)
          + name                       = "labs-jefex7"
          + priority                   = 260
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "labs-matthewsearle01-v3"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "labs-matthewsearle01-v3"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "labs-matthewsearle01-v3"
          + id                         = (known after apply)
          + name                       = "labs-matthewsearle01-v3"
          + priority                   = 250
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "labs-mokainosjavaapp"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "labs-mokainosjavaapp"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "labs-mokainosjavaapp"
          + id                         = (known after apply)
          + name                       = "labs-mokainosjavaapp"
          + priority                   = 180
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "labs-mokainosspringboot"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "labs-mokainosspringboot"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "labs-mokainosspringboot"
          + id                         = (known after apply)
          + name                       = "labs-mokainosspringboot"
          + priority                   = 170
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "labs-msl8r"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "labs-msl8r"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "labs-msl8r"
          + id                         = (known after apply)
          + name                       = "labs-msl8r"
          + priority                   = 190
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "labs-ozzyib"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "labs-ozzyib"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "labs-ozzyib"
          + id                         = (known after apply)
          + name                       = "labs-ozzyib"
          + priority                   = 230
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "labs-rajivkapoor1"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "labs-rajivkapoor1"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "labs-rajivkapoor1"
          + id                         = (known after apply)
          + name                       = "labs-rajivkapoor1"
          + priority                   = 240
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "labs-raraybould"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "labs-raraybould"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "labs-raraybould"
          + id                         = (known after apply)
          + name                       = "labs-raraybould"
          + priority                   = 290
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "labs-ssian2"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "labs-ssian2"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "labs-ssian2"
          + id                         = (known after apply)
          + name                       = "labs-ssian2"
          + priority                   = 200
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "labs-zc-hmcts"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "labs-zc-hmcts"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "labs-zc-hmcts"
          + id                         = (known after apply)
          + name                       = "labs-zc-hmcts"
          + priority                   = 210
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "prometheus-0"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "prometheus-0"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "prometheus-0"
          + id                         = (known after apply)
          + name                       = "prometheus-0"
          + priority                   = 420
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "prometheus-1"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "prometheus-1"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "prometheus-1"
          + id                         = (known after apply)
          + name                       = "prometheus-1"
          + priority                   = 430
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "reform-scan-blob-router"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "reform-scan-blob-router"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "reform-scan-blob-router"
          + id                         = (known after apply)
          + name                       = "reform-scan-blob-router"
          + priority                   = 390
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "reform-scan-notification-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "reform-scan-notification-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "reform-scan-notification-service"
          + id                         = (known after apply)
          + name                       = "reform-scan-notification-service"
          + priority                   = 400
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rpe-send-letter-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rpe-send-letter-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rpe-send-letter-service"
          + id                         = (known after apply)
          + name                       = "rpe-send-letter-service"
          + priority                   = 380
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

        # (52 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1576,"Program":"tfcmt","SHA1":"","Target":"sbox-backendappgateway","Vars":{}} -->